Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
  /* Get MW LoraWAN info */


  /* Get MW SubGhz_Phy info */

  /* USER CODE BEGIN LoRaWAN_Init_Last */
 // MX_USART2_Init();
 // MX_I2C1_Init();
  /* bmp280_init_default_params(&bmp280.params);
   	bmp280.addr = BMP280_I2C_ADDRESS_0;
   	bmp280.i2c = &hi2c1;
   	*/
  /* USER CODE END LoRaWAN_Init_Last */
//}

void BSP_PB_Callback(Button_TypeDef Button)
{
  /* USER CODE BEGIN BSP_PB_Callback_1 */

  /* USER CODE END BSP_PB_Callback_1 */
  switch (Button)
  {
    case  BUTTON_USER:
      UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
      /* USER CODE BEGIN PB_Callback 1 */
      /* USER CODE END PB_Callback 1 */
      break;
    default:
      break;
  }
  /* USER CODE BEGIN BSP_PB_Callback_Last */

  /* USER CODE END BSP_PB_Callback_Last */
}

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */

  /* USER CODE END OnRxData_1 */
  if ((appData != NULL) && (params != NULL))
  {
    LED_On(LED_BLUE);
    static const char *slotStrings[] = { "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot" };

//    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Indication ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_M, "\r\n ========== Индикация приёма данных ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, " D/L FRAME:%04d | SLOT:%s | PORT:%d | DR:%d | RSSI:%d | SNR:%d\r\n",
            params->DownlinkCounter, slotStrings[params->RxSlot], appData->Port, params->Datarate, params->Rssi, params->Snr);
    switch (appData->Port)
    {
      case LORAWAN_SWITCH_CLASS_PORT:
        /*this port switches the class*/
        if (appData->BufferSize == 1)
        {
          switch (appData->Buffer[0])
          {
            case 0:
            {
              LmHandlerRequestClass(CLASS_A);
              break;
            }
            case 1:
            {
              LmHandlerRequestClass(CLASS_B);
              break;
            }
            case 2:
            {
              LmHandlerRequestClass(CLASS_C);
              break;
            }
            default:
              break;
          }
        }
        break;
      case LORAWAN_USER_APP_PORT:
        if (appData->BufferSize == 1)
        {
          AppLedStateOn = appData->Buffer[0] & 0x01;
          if (AppLedStateOn == RESET)
          {
            APP_LOG(TS_OFF, VLEVEL_H,   "LED OFF\r\n");

            LED_Off(LED_RED1);
          }
          else
          {
            APP_LOG(TS_OFF, VLEVEL_H, "LED ON\r\n");

            LED_On(LED_RED1);
          }
        }
        break;
      /* USER CODE BEGIN OnRxData_Switch_case */

      /* USER CODE END OnRxData_Switch_case */
      default:
        /* USER CODE BEGIN OnRxData_Switch_default */

        /* USER CODE END OnRxData_Switch_default */
        break;
    }
  }

  /* USER CODE BEGIN OnRxData_2 */

  /* USER CODE END OnRxData_2 */
}

static void SendTxData(void)
{
	// uint8_t payload = "textovik";
	 uint16_t pressure = 0;
	 int16_t temperature = 0;
	 // uint16_t humidity = 0;
//	 float pressure1, temperature1, humidity1, numberdev, per, time; // номер устройста и период добавил

  	//uint16_t pressure = 0;
  	//int16_t temperature = 0;
  	uint16_t Defbuff;  // для счётчика с охранной кнопки
  sensor_t sensor_data;
  uint16_t size;
  uint8_t Datasens[256];
  UTIL_TIMER_Time_t nextTxIn = 0;
  bmp280_params_t params;
	RTC_TimeTypeDef sTime1;
  	RTC_DateTypeDef sDate1;
  	uint8_t buffer[20];
  	volatile uint16_t adc = 0;
#ifdef CAYENNE_LPP
  uint8_t channel = 0;
#else
   uint16_t humidity = 0;
  uint32_t i = 0;
  int32_t latitude = 0;
  int32_t longitude = 0;
  uint16_t altitudeGps = 0;
#endif /* CAYENNE_LPP */
  /* USER CODE BEGIN SendTxData_1 */

  /* USER CODE END SendTxData_1 */

  /* EnvSensors_Read(&sensor_data);
  #if defined (SENSOR_ENABLED) && (SENSOR_ENABLED == 1)

    temperature = (int16_t) sensor_data.temperature;

  #else
   temperature = (SYS_GetTemperatureLevel() >> 8);
  #endif  /* SENSOR_ENABLED */
  /*  pressure    = (uint16_t)(sensor_data.pressure * 100 / 10);      /* in hPa / 10 */

    AppData.Port = LORAWAN_USER_APP_PORT;
    /*
#ifdef CAYENNE_LPP
  CayenneLppReset();
  CayenneLppAddBarometricPressure(channel++, pressure);
  CayenneLppAddTemperature(channel++, temperature);
  CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity));

  if ((LmHandlerParams.ActiveRegion != LORAMAC_REGION_US915) && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AU915)
      && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AS923))
  {
    CayenneLppAddDigitalInput(channel++, GetBatteryLevel());
    CayenneLppAddDigitalOutput(channel++, AppLedStateOn);
  }

  CayenneLppCopy(AppData.Buffer);
  AppData.BufferSize = CayenneLppGetSize();
#else  /* not CAYENNE_LPP */
    /*  humidity    = (uint16_t)(sensor_data.humidity * 10);            /* in %*10     */

  // AppData.Buffer[i++] = AppLedStateOn; //////////////////////////////// ДАЁТ 00 В НАЧАЛЕ
    /*  AppData.Buffer[i++] = (uint8_t)((pressure >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(pressure & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);

  //AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
   */
  // payload == "text";
  // AppData.Buffer[i++] = payload;
  // BMP280_HandleTypedef bmp280;
  // LmHandlerGetDevAddr = i;
// HAL_I2C_GetState(&hi2c1);
 // HAL_I2C_Master_Receive(&bmp280);
	 // I2C_DMAMasterReceiveCplt(DMA_HandleTypeDef *hdma)
		//HAL_I2C_GetState;
  // __B_L072Z_LRWAN1_BSP_VERSION_MAIN = i;
  // bmp280_init_default_params(&bmp280.params);
  //  bmp280.addr = BMP280_I2C_ADDRESS_0;
  //
  // MX_I2C1_Init();
 // MX_USART2_Init();
  // MX_I2C1_Init();
  // BSP_SPI1_Init();
  BSP_I2C1_Init();
  MX_ADC_Init();
  MX_LPTIM1_Init();

//  HAL_LPTIM_Encoder_Start_IT(&hlptim1, 1000);
  // MX_USART1_Init();
  //MX_LPTIM1_Init();
  // calendarValue;
  // HAL_RTC_GetDate(&hrtc, RTC_DateStruct, RTC_FORMAT_BIN);
  //    HAL_RTC_GetTime();
  /*   MX_RTC_Init();
      UTIL_TIMER_GetCurrentTime();
        AppData.Buffer[i++] = UTIL_TIMER_GetCurrentTime; // дата и время
      HAL_RTC_GetTime(&hrtc, &sTime1, RTC_FORMAT_BCD); //
      HAL_RTC_GetDate(&hrtc, &sDate1, RTC_FORMAT_BCD); //
       buffer[0] = (sDate1.Date / 16) + 48; //
      		buffer[1] = (sDate1.Date % 16) + 48; //
    		buffer[2] = '.';
    		buffer[3] = (sDate1.Month / 16) + 48;
    		buffer[4] = (sDate1.Month % 16) + 48;
    		buffer[5] = '.';
    		buffer[6] = '2';
    		buffer[7] = '0';
    		buffer[8] = (sDate1.Year / 16) + 48;
    		buffer[9] = (sDate1.Year % 16) + 48;
    		buffer[10] ='@';
    		buffer[11] = (sTime1.Hours / 16) + 48;
    		buffer[12] = (sTime1.Hours % 16) + 48;
    		buffer[13] = ':';
    		buffer[14] = (sTime1.Minutes / 16) + 48;
    		buffer[15] = (sTime1.Minutes % 16) + 48;
    		buffer[16] = ':';
    		buffer[17] = (sTime1.Seconds / 16) + 48;
    		buffer[18] = (sTime1.Seconds % 16) + 48;
    		 */
  // MX_I2C1_Init();
 // HAL_I2C_GetState;// cntGetValue(&Defbuff);  // здесь будет сбор значения вскрытий// HTS221_Init(pObj);//HTS221_GetCapabilities(pObj, Capabilities);  //  HAL_LPTIM_Counter_Start_IT(&hlptim1,1000);
  // HAL_LPTIM_Counter_Start_IT(&hlptim1,1000);
    //	  HAL_Delay(200);  //	UTIL_TIMER_Create(&ReadLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);  // UTIL_TIMER_SetPeriod(&ReadLedTimer, 5000);  	//UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  	  bmp280_init_default_params(&bmp280.params);
    	bmp280.addr = BMP280_I2C_ADDRESS_0;
    	bmp280.i2c = &hi2c1;
    	bmp280_init(&bmp280, &bmp280.params);
    	HAL_Delay(2000);
    	 //size = sprintf((char *)Data, "BMP280 initialization failed\n");
    	 // HAL_UART_Transmit(&husart2, Data, size, 1000);
    	 //HAL_Delay(200);
    	//		bool bme280p = bmp280.id == BME280_CHIP_ID;
//    	   	 	size = sprintf((char *)Data, "BMP280: found %s\n", bme280p ? "BME280" : "BMP280");
    	// 	HAL_UART_Transmit(&husart2, Data, size, 1000);
    	// APP_LOG(TS_OFF, VLEVEL_M, "MW_:   V%X.%X.%X\r\n",
    	//		 (uint8_t) buffer[20]);
    	/*	while (!bmp280_init(&bmp280, &bmp280.params)) {
    			size = sprintf((char *)Data, "BMP280 initialization failed\n");
    			 HAL_UART_Transmit(&huart2, Data, size, 1000);
    			HAL_Delay(200);
    		}
        */
    	// HTS221_Init(&hts221);
    	 // HTS221_GetCapabilities(&hts221, temperature);
  // bmp280.i2c = &hi2c1;
  //  bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1); старое
    	// HAL_Delay(100);
//    	 bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
    	 bmp280_read_fixed(&bmp280, &temperaturei, &pressurei, &humidityi);
    	 int32_t temp_decimal = temperaturei % 100; // Получаем 2-ю цифру после запятой
//    	  size = sprintf((char *)Datasens,
//    				  					"%d:%d:%d\n", (int)temperature1,(int)pressure1,(int)humidity1);

//    	HAL_UART_Transmit(&husart2, Data, size, 1000);
//    	HAL_UART_Transmit(&husart1, Datasens, size, 1000);
//    	HAL_Delay(200);
//    	APP_LOG(TS_OFF, VLEVEL_M, " Температура:%d | Влажность:%d\r\n", Datasens, Datasens);
//    	 APP_LOG(TS_OFF, VLEVEL_M, " Номер модема:%d | Температура:%d | Влажность:%d | Период передачи:%d сек | Заряд батареи:%d%\r\n",
//    		       		numberdev, temperaturei, humidityi, per, chargebattery);

    	 if(bmp280.dig_T1!=0)
    	//*/
    	{
//    	  APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== Temp, hum sensor Init ====\r\n");
    	  APP_LOG(TS_OFF, VLEVEL_M, " Датчик измерения активен \n");
    	} //*/
    	 else
    	 {

//    		 APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== Sensor initialization failed ====\r\n");
    		 APP_LOG(TS_OFF, VLEVEL_M, "<  Ошибка инициализации датчика >  \r\n");
    	 }

    	 if(temperaturei/100>=1 && temperaturei/100<=30)
//    		 if(temperature1>=1 && temperature1<=30 && pressure1>=1)
    	     	//*/
    	  {
//    	     	  APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== All parameters normal ====\r\n");
    	     	  APP_LOG(TS_OFF, VLEVEL_M, " Параметры окружающей среды в норме \r\n");
    	  } //*/
    	     	 else
    	   {
//    	     		 APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== Accident ====\r\n");
    	       		 APP_LOG(TS_OFF, VLEVEL_M, " < Отклонение от нормы > \r\n");
    	   }
    	 modelnum = 1;
    	 // EEPROMWRITE modelnum
    	 numberdev = 0x01;  // new 0b00010001
    	 per = 0xA; // new
         FirmwareVersion = 1.1;

  // bool bme280p = bmp280.id == BME280_CHIP_ID;
 // size = (temperature1, pressure1, humidity1);
//    size = (temperature1, pressure1, humidity1);
//    size = sprintf((char *)Data, "Sensor initialization failed\n");

    //    size = (Capabilities);
    // size = sprintf((char *)Data,
    //	  					"%d:%d:%d\n", (int)temperature,(int)pressure,(int)humidity);
    // printf("IDDDDDDDDDDD 2\n\r");
    //snprintf("IDDDDDDDDDDD 2\n\r");
    // vprintf(size);
    // putchar("IDDDDDDDDDDD 2\n\r");
    // HAL_ADC_Start(&hadc1); // запускаем преобразование сигнала АЦП
    // adc = HAL_ADC_GetValue(&hadc1); // читаем полученное значение в переменную adc
    //	HAL_ADC_Stop(&hadc1); // останавливаем АЦП (не обязательно)
    //   HAL_UART_Transmit(&husart1, Data, size, 1000);
    // HAL_UART_Transmit(&husart1, Data, size, 1000);'
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    //   HAL_Delay(200);

