Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
  /* USER CODE BEGIN OnJoinRequest_1 */

  /* USER CODE END OnJoinRequest_1 */
  if (joinParams != NULL)
  {
    if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
    {
      UTIL_TIMER_Stop(&JoinLedTimer);

      LED_Off(LED_RED1) ;

//      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
      APP_LOG(TS_OFF, VLEVEL_M, " Устройство подключено \r\n  ");
      //if (joinParams->Mode == ACTIVATION_TYPE_ABP) //
      if (joinParams->Mode == ACTIVATION_TYPE_OTAA)
      {
//        APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
    	  APP_LOG(TS_OFF, VLEVEL_M, " Активация по воздуху  \r\n");

      }
      else
      {
//        APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
    	  APP_LOG(TS_OFF, VLEVEL_M, " Активация по персонализации  \r\n");
      }
    }
    else
    {
//      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
      APP_LOG(TS_OFF, VLEVEL_M, " < Подключение к базовой станции не удалось > \r\n");
    }
  }

  /* USER CODE BEGIN OnJoinRequest_2 */

  /* USER CODE END OnJoinRequest_2 */
}
/*void SystemClock_Config(void) //NEW С МЭЙНА
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0}; //NEW
  /* Enable HSE Oscillator and Activate PLL with HSE as source */
/* RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI;// new добавил |RCC_OSCILLATORTYPE_LSI
  RCC_OscInitStruct.HSEState            = RCC_HSE_OFF;
  RCC_OscInitStruct.HSIState            = RCC_HSI_ON;
  RCC_OscInitStruct.LSIState 			= RCC_LSI_ON;	// new
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource       = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL          = RCC_PLLMUL_6;
  RCC_OscInitStruct.PLL.PLLDIV          = RCC_PLLDIV_3;

  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* Set Voltage scale1 as MCU will run at 32MHz */
/* __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /* Poll VOSF bit of in PWR_CSR. Wait until it is reset to 0 */
/*  while (__HAL_PWR_GET_FLAG(PWR_FLAG_VOS) != RESET) {};

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
  clocks dividers */
/*  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
  // /*   new
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART2
                                |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_RTC
                                |RCC_PERIPHCLK_LPTIM1;
    PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
    PeriphClkInit.LptimClockSelection = RCC_LPTIM1CLKSOURCE_PCLK;

    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    {
      Error_Handler();
    }
  }
  */
/*

 */ static void MX_LPTIM1_Init(void) // new
{

  /* USER CODE BEGIN LPTIM1_Init 0 */

  /* USER CODE END LPTIM1_Init 0 */

  /* USER CODE BEGIN LPTIM1_Init 1 */

  /* USER CODE END LPTIM1_Init 1 */
//	  hlptim1.Instance = LPTIM1;
//	  hlptim1.Init.Clock.Source = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
//	  hlptim1.Init.Clock.Prescaler = LPTIM_PRESCALER_DIV1;
//	  hlptim1.Init.UltraLowPowerClock.Polarity = LPTIM_CLOCKPOLARITY_RISING;
//	  hlptim1.Init.UltraLowPowerClock.SampleTime = LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION;
//	  hlptim1.Init.Trigger.Source = LPTIM_TRIGSOURCE_SOFTWARE;
//	  hlptim1.Init.OutputPolarity = LPTIM_OUTPUTPOLARITY_HIGH;
//	  hlptim1.Init.UpdateMode = LPTIM_UPDATE_IMMEDIATE;
//	  hlptim1.Init.CounterSource = LPTIM_COUNTERSOURCE_EXTERNAL;
//  if (HAL_LPTIM_Init(&hlptim1) != HAL_OK)
//  {
//    Error_Handler();
//  }
  /*
  /* USER CODE BEGIN LPTIM1_Init 2 */

  /* USER CODE END LPTIM1_Init 2 */

}
//  void HAL_LPTIM_MspInit(LPTIM_HandleTypeDef* hlptim)
//  {
//    GPIO_InitTypeDef GPIO_InitStruct = {0};
//    if(hlptim->Instance==LPTIM1)
//    {
//    /* USER CODE BEGIN LPTIM1_MspInit 0 */
//
//    /* USER CODE END LPTIM1_MspInit 0 */
//      /* Peripheral clock enable */
//      __HAL_RCC_LPTIM1_CLK_ENABLE();
//
//      __HAL_RCC_GPIOB_CLK_ENABLE();
      /**LPTIM1 GPIO Configuration
      PB5     ------> LPTIM1_IN1
      PB7     ------> LPTIM1_IN2
      */
//      GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_7;
//      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//      GPIO_InitStruct.Pull = GPIO_NOPULL;
//      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//      GPIO_InitStruct.Alternate = GPIO_AF2_LPTIM1;
//      HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//
//      /* LPTIM1 interrupt Init */
//      HAL_NVIC_SetPriority(LPTIM1_IRQn, 0, 0);
//      HAL_NVIC_EnableIRQ(LPTIM1_IRQn);
    /* USER CODE BEGIN LPTIM1_MspInit 1 */

    /* USER CODE END LPTIM1_MspInit 1 */
//    }
//
//  }

  /**
  * @brief LPTIM MSP De-Initialization
  * This function freeze the hardware resources used in this example
  * @param hlptim: LPTIM handle pointer
  * @retval None
  */
//  void HAL_LPTIM_MspDeInit(LPTIM_HandleTypeDef* hlptim)
//  {
//    if(hlptim->Instance==LPTIM1)
//    {
//    /* USER CODE BEGIN LPTIM1_MspDeInit 0 */
//
//    /* USER CODE END LPTIM1_MspDeInit 0 */
//      /* Peripheral clock disable */
//      __HAL_RCC_LPTIM1_CLK_DISABLE();
//
//      /**LPTIM1 GPIO Configuration
//      PB5     ------> LPTIM1_IN1
//      PB7     ------> LPTIM1_IN2
//      */
//      HAL_GPIO_DeInit(GPIOB, GPIO_PIN_5|GPIO_PIN_7);
//
//      /* LPTIM1 interrupt DeInit */
//      HAL_NVIC_DisableIRQ(LPTIM1_IRQn);
//    /* USER CODE BEGIN LPTIM1_MspDeInit 1 */
//
//    /* USER CODE END LPTIM1_MspDeInit 1 */
//    }
//
//  }

static void OnMacProcessNotify(void)
{
  /* USER CODE BEGIN OnMacProcessNotify_1 */

  /* USER CODE END OnMacProcessNotify_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);
  /* USER CODE BEGIN OnMacProcessNotify_2 */

  /* USER CODE END OnMacProcessNotify_2 */
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

